
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.sa_storage_account.azurerm_storage_container.container[&#34;pre-b2c-container&#34;]
* Update
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_storage_container.pre_b2c_container


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_container.pre_b2c_container will be destroyed
  # (because azurerm_storage_container.pre_b2c_container is not in configuration)
  - resource "azurerm_storage_container" "pre_b2c_container" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://presastg.blob.core.windows.net/pre-b2c-container" -> null
      - metadata                = {} -> null
      - name                    = "pre-b2c-container" -> null
      - resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default/containers/pre-b2c-container" -> null
      - storage_account_name    = "presastg" -> null
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ allow_nested_items_to_be_public   = false -> true
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Deny" -> "Allow"
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_container.container["pre-b2c-container"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "container"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "pre-b2c-container"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "presastg"
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":715,"Program":"tfcmt","SHA1":"","Vars":{}} -->